{
	"neutron_dex_module_grpc": [
		"Create a swap router that converts ATOM to NTRN on Neutron DEX with a maximum 0.5 % slippage.",
		"Instantiate a liquidity pool for NTRN / USDC with 1 000 NTRN and 3 000 USDC initial liquidity and set the trading fee to 0.20 %.",
		"Deploy a contract that submits a market buy of 50 ATOM for NTRN every hour using the DEX gRPC endpoint.",
		"Set up a job that queries the 24-hour volume of the NTRN-ATOM pool via gRPC and stores the value on-chain every 30 minutes.",
		"Place a limit sell order for 500 NTRN at 0.8 ATOM each and cancel it automatically after 24 hours if it’s not filled.",
		"Withdraw 20 % of my existing NTRN-USDC liquidity-provider position back to my wallet.",
		"Open a 2× leveraged long on the NTRN-USDT perp pair through the DEX gRPC interface.",
		"Deploy a governance-controlled contract that lets an admin adjust the pool’s trading fee between 0.1 % and 0.3 %.",
		"Create an auto-rebalancing vault that moves liquidity from the NTRN-USDC pool to the NTRN-ATOM pool whenever the NTRN price rises above 1 USDC.",
		"Register a gRPC price-feed callback that triggers an emergency halt if NTRN drops more than 15 % in 10 minutes."
	],
	"neutron_interchain_queries": [
		"Every hour, query my wallet’s ATOM balance on the Cosmos Hub and emit an event if it drops below 10 ATOM.",
		"Set up an interchain query that fetches the total supply of OSMO from Osmosis once per day and stores it in the contract state.",
		"Monitor staking rewards: pull my delegation rewards for validator cosmosvaloper1… on the Cosmos Hub every six hours.",
		"Track the price feed contract’s price field on chain ID injective-1; alert if the value changes by more than 5 % within an hour.",
		"Every 30 minutes, query the IBC channel state for channel-42 on Juno and write its packet-sequence height to contract storage.",
		"Watch the governance module on Gaia: retrieve any proposal with status ‘VotingPeriod’ and send its title and end-time back to Neutron.",
		"Check the validator set on Osmosis daily and flag if validator osmovaloper1… gets jailed or its commission exceeds 20 %.",
		"Pull the current inflation rate from the bank module parameters of chain terra-2 and store it in a map called inflation_rates.",
		"Every block, query pending IBC transfers to my Neutron address from channel-17 on Sei and increment a counter when a new packet arrives.",
		"Register an interchain query that watches the staking unbonding queue length on Cosmos Hub and triggers a sudo callback if it exceeds 50 entries."
	],
	"neutron_ibc_transfer": [
		"Send 500 NTRN from my Neutron wallet to address cosmos1… on the Cosmos Hub over channel-0, then record the packet ID in state.",
		"Every Friday at 12:00 UTC, transfer 100 USDC from Neutron to Osmosis address osmo1… via channel-42.",
		"Move 25 ATOM from wallet A on Neutron to wallet B on Juno, but cancel if the fee exceeds 0.05 ATOM.",
		"Batch-transfer these amounts to Stargaze (channel-17) in a single call: 10 000 STARS to stars1… and 50 ATOM to stars1…xyz.",
		"Once a day, sweep any NTRN balance over 1 000 from my Neutron account to the same address on Noble (channel-31).",
		"Open an IBC channel to chain injective-1 if none exists, then send 3 000 USDT to inj1….",
		"Transfer 2 000 NTRN to Cosmos Hub and, upon successful acknowledgement, trigger a sudo callback that stakes the same amount on Neutron.",
		"Send 1 BTC.b (NTRN-native denom ubtc) to Osmosis and notify me (emit an event) if the timeout height is reached without ack.",
		"Every block, forward any incoming IBC packets with denom uatom from channel-5 directly to my address on Axelar (channel-88).",
		"Create a recurring monthly payment: on the 1st of each month move 150 NTRN from my DAO treasury module to cosmos1…fund on Cosmos Hub over channel-0, memo ‘DAO Ops Budget’."
	],
	"neutron_interchain_transactions": [
		"Open an interchain account on the Cosmos Hub and delegate 500 ATOM from that account to validator cosmosvaloper1….",
		"Every day at 18:00 UTC, claim staking rewards from my interchain account on Juno and transfer the rewards back to my Neutron wallet.",
		"Submit a governance vote from the interchain account on Osmosis: vote ‘Yes’ on proposal #432 with a 0.02 OSMO fee.",
		"Stake 1 000 USDC on Noble via the interchain account, selecting the top-ranked validator by voting power.",
		"Open an interchain account on Sei, execute a swap of 200 USDT → NTRN on the native DEX, then send the received NTRN back to Neutron.",
		"From the interchain account on Cosmos Hub, unbond 300 ATOM from validator cosmosvaloper1… and restake it to validator cosmosvaloper2… once the unbonding period ends.",
		"Using the interchain account on Osmosis, add 1 000 NTRN and 1 000 OSMO as liquidity to the NTRN-OSMO pool, and record the pool share amount in state.",
		"Create an ICA on Axelar and execute a cross-chain transfer of 250 NTRN from Neutron to Ethereum address 0xABC… via Axelar’s deposit contract.",
		"Every 4 hours, check the interchain account’s ATOM balance on Cosmos Hub; if the balance exceeds 2 000 ATOM, send the excess back to Neutron.",
		"Register an interchain transaction that posts a text proposal (‘Fund community dev fund’) on Juno governance, deposits 100 JUNO for it, and then votes ‘Yes’ after deposit confirmation."
	],
	"reflect": [
		"Send 15 NTRN from my wallet to neutron1fees… through the reflect contract, so the transfer shows up as from the contract.",
		"Execute the increment method on counter-contract neutron1cnt… and store the sub-message reply ID in reflect contract state.",
		"Batch: (a) transfer 200 USDC to neutron1treasury…, then (b) call stake on contract neutron1farm… with amount = 500 NTRN in a single reflected tx.",
		"Perform a wasm execute on NFT contract neutron1nft… to mint token ID 42 to my address, using reflect so my private key only signs once.",
		"Every hour, query total supply from CW20 contract neutron1cw20… via reflect’s smart-query feature and write the result into reflect storage under key cw20_supply.",
		"Forward any funds sent to the reflect contract automatically to neutron1cold… and emit ‘Forwarded’ events.",
		"Use reflect to open an IBC transfer: send 75 ATOM on channel-0 to cosmos1def… with a 2-hour timeout.",
		"Schedule a sub-message that calls claim_rewards {} on contract neutron1farm… exactly 10 blocks from now.",
		"Register a sudo callback in the reflect contract that triggers if a sub-message reply contains error and stores the error string.",
		"Migrate contract neutron1old… to code-ID 77 and set admin = neutron1gov…, executed via reflect to keep my wallet off the admin list."
	]
}